import datetime
import time

"""1. Вывести текущую дату"""
# current_date = datetime.datetime.now()
# print(current_date)

"""2. Использование time для задержек времени полета"""
# speeds = [10, 20, 30, 40, 50]
# for speed in speeds:
#     print(f"Текущая скорость {speed}")
#     time.sleep(2)

"""3/ использование datetime для временных меток"""
# start_time = datetime.datetime.now()
# print(f"Время начала полета {start_time}")
# time.sleep(6)
#
# end_time = datetime.datetime.now()
# print(f"Время окончания полета {end_time}")
#
# flight_duranion = end_time - start_time
# print(f"Продолжительность полета {flight_duranion} секунд")

"""4. """